Revit 2024 API
TaskDialog.TitleAutoPrefix Property
 Whether the TaskDialog's title will automatically have the add-in name added as a prefix.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public bool TitleAutoPrefix { get; set; }
Visual Basic
Public Property TitleAutoPrefix As Boolean
	Get
	Set
Visual C++
public:
property bool TitleAutoPrefix {
	bool get ();
	void set (bool value);
}
Remarks
 The default value is true.
See Also
TaskDialog Class
Autodesk.Revit.UI Namespace